toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(250));
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//        }
        
//        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
        const MSP::ImgRingBuf& imgRingBuf = _State.sd.imgRingBufs[0];
        
        // Init our tasks
        // This is necessary because we may have stopped them at an arbitrary point via _HostModeSet()
        _Init();
        _TaskSD::Init();
        _TaskImg::Init();
        
        // Init SPI peripheral
        _SPI::Init();
        
        for (;;) {
//            // Wait for motion. During this block we allow LPM3.5 sleep, as long as our other tasks are idle.
//            {
//                _WaitingForMotion = true;
//                _Scheduler::Wait([&] { return (bool)_Motion; });
//                _Motion = false;
//                _WaitingForMotion = false;
//            }
            
            // Turn on VDD_B power (turns on ICE40)
            _VDDBSet(true);
            
            // Wait for ICE40 to start
            // We specify (within the bitstream itself, via icepack) that ICE40 should load
            // the bitstream at high-frequency (40 MHz).
            // According to the datasheet, this takes 70ms.
            _Scheduler::Sleep(_Scheduler::Ms(30));
            _ICEInit();
            
            // Reset SD nets before we turn on SD power
            _TaskSD::CardReset();
            _TaskSD::Wait();
            
            // Turn on IMG/SD power
            _VDDIMGSDSet(true);
            
            // Init image sensor / SD card
            _TaskImg::SensorInit();
            _TaskSD::CardInit();
            
            for (;;) {
                // Capture an image
                {
                    _LEDGreen_::Set(_LEDGreen_::Priority::Low, 0);
                    
                    // Wait for _TaskSD to be initialized and done with writing, which is necessary
                    // for 2 reasons:
                    //   1. we have to wait for _TaskSD to initialize _State.sd.imgRingBufs before we
                    //      access it,
                    //   2. we can't initiate a new capture until writing to the SD card (from a
                    //      previous capture) is complete (because the SDRAM is single-port, so
                    //      we can only read or write at one time)
                    _TaskSD::WaitForInitAndWrite();
                    
                    // Capture image to RAM
                    _TaskImg::Capture(imgRingBuf.buf.idEnd);
                    const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
                    
                    // Copy image from RAM -> SD card
                    _TaskSD::Write(srcRAMBlock);
                    _TaskSD::Wait();
                    
                    _LEDGreen_::Set(_LEDGreen_::Priority::Low, 1);
                }
                
                break;
                
//                // Wait up to 1s for further motion
//                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
//                if (!motion) break;
//                
//                // Only reset _Motion if we've observed motion; otherwise, if we always reset
//                // _Motion, there'd be a race window where we could first observe
//                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
//                // the true value by resetting it to false.
//                _Motion = false;
            }
            
            _VDDIMGSDSet(false);
            _VDDBSet(false);
            
            _Scheduler::Sleep(_Scheduler::Ms(3000));
        }
    }
    
    static void _Init() {
        // Reset our shared state
        // This is used to init our task after it's been stopped in an arbitrary state.
        _WaitingForMotion = false;
    }
    
    static bool DeepSleepOK() {
        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
        // This logic works because if _WaitingForMotion==true, then we've disabled both _TaskSD
        // and _TaskImg, so if the tasks are idle, then everything's idle so we can enter deep
        // sleep. (The case that we need to be careful of is going to sleep when either _TaskSD
        // or _TaskImg is idle but still powered on, which the _WaitingForMotion check takes
        // care of.)
        return _WaitingForMotion                &&
               !_Scheduler::Running<_TaskSD>()  &&
               !_Scheduler::Running<_TaskImg>() ;
    }
    
    static void ISR_MotionSignal(uint16_t iv) {
        _Motion = true;
    }
    
    // _Init: stores whether this is the first
    [[gnu::section(".ram_backup.main")]]
    static inline bool _FirstRunDone = false;
    
    // _Motion: announces that motion occurred
    // _Motion: atomic because it's modified from the interrupt context
    static inline std::atomic<bool> _Motion = false;
    static inline bool _WaitingForMotion = false;
    
    // Task stack
    [[gnu::section(".stack._TaskMain")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

static inline bool _HostMode = false;

static void _HostModeSet(bool en) {
    // Short-circuit if the state hasn't changed
    if (_HostMode == en) return;
    _HostMode = en;
    
    if (_HostMode) {
        // Reset state
        _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
        _LEDGreen_::Set(_LEDGreen_::Priority::Low, 1);
        // Stop _TaskMain
        _Scheduler::Stop<_TaskSD>();
        _Scheduler::Stop<_TaskImg>();
        _Scheduler::Stop<_TaskMain>();
        // Turn off power
        _VDDIMGSDSet(false);
        _VDDBSet(false);
    
    } else {
        _Scheduler::Start<_TaskMain>();
    }
}

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
