toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
            // Relinquish LEDs
            _LEDRed_::Set(_LEDRed_::Priority::High, std::nullopt);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, std::nullopt);
            
            // Exit host mode
            _HostModeSet(false);
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.chunk * sizeof(MSP::Resp::arg.StateRead.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.chunk * sizeof(MSP::Cmd::arg.StateWrite.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_::Set(_LEDRed_::Priority::High, !cmd.arg.LEDSet.red);
            _LEDGreen_::Set(_LEDGreen_::Priority::High, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeSet:
            _RTC::Init(cmd.arg.TimeSet.time);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            _HostModeSet(cmd.arg.HostModeSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryChargeLevelGet: {
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryChargeLevelGet = { .level = _BatterySampler::Sample() } },
            };
        }
        
        default:
            return MSP::Resp{ .ok = false };
        }
    }
    
    // Task stack
    [[gnu::section(".stack._TaskI2C")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[256];
};

struct _TaskButton {
    static void Run() {
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            // Ignore button presses in host mode
            if (_HostMode) continue;
            
            switch (ev) {
            case _Button::Event::Press:
                // Take a photo
                _LEDRed_::Set(_LEDRed_::Priority::Low, 0);
                _Scheduler::Sleep(_Scheduler::Ms(250));
                _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
                break;
            
            case _Button::Event::Hold:
                // Blink red LED to signal that we're turning off
                for (int i=0; i<5; i++) {
                    _Pin::LED_RED_::Write(0);
                    _Scheduler::Delay(_Scheduler::Ms(50));
                    _Pin::LED_RED_::Write(1);
                    _Scheduler::Delay(_Scheduler::Ms(50));
                }
                
                #warning TODO: disable any timer interrupt sources that we may have set up, so we don't wake to take a photo
                
                _MOTION_SIGNAL_DISABLED::Init<_Pin::MOTION_SIGNAL>();
                
                // Configure button for device turning off
                _Button::OffConfig();
                
                // Turn off
                __Sleep(_SleepMode::Deep);
                break;
            }
        }
    }
    
    // Task stack
    [[gnu::section(".stack._TaskButton")]]
    alignas(sizeof(void*))
    static inline uint8_t Stack[128];
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static uint16_t _LPMForSleepMode(_SleepMode mode) {
    switch (mode) {
    case _SleepMode::Light: return LPM1_bits;
    case _SleepMode::Deep:  return LPM3_bits;
    default:                return 0;
    }
}

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    // If deep sleep is OK, enter LPM3.5 sleep, where RAM content is lost.
    // Otherwise, enter LPM1 sleep, because something is running.
    __Sleep(_TaskMain::DeepSleepOK() ? _SleepMode::Deep : _SleepMode::Light);
}

static void __Sleep(_SleepMode mode) {
    const uint16_t lpm = _LPMForSleepMode(mode);
    
    // If we're entering LPM3/LPM4, disable regulator so we enter LPM3.5 / LPM4.5 (instead of just LPM3/LPM4)
    if (lpm==LPM3_bits || lpm==LPM4_bits) {
        PMMUnlock pmm; // Unlock PMM registers
        PMMCTL0_L |= PMMREGOFF_L;
    }
    
    // Remember our current interrupt state, which IntState will restore upon return
    Toastbox::IntState ints;
    // Atomically enable interrupts and go to sleep
    __bis_SR_register(GIE | lpm);
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC::ISR();
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (__even_in_range(iv, 0x10)) {
    
    // Motion
    case _Pin::MOTION_SIGNAL::IVPort2():
        _TaskMain::ISR_MotionSignal(iv);
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // I2C (ie VDD_B_3V3_STM)
    case _I2C::Pin::Active::IVPort2():
        _I2C::ISR_Active(iv);
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // Button
    case _Button::Pin::IVPort2():
        _Button::ISR();
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(USCI_B0_VECTOR)]]
static void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    __bic_SR_register_on_exit(LPM0_bits);
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

[[gnu::interrupt(ADC_VECTOR)]]
static void _ISR_ADC() {
    _BatterySampler::ISR(ADCIV);
    // Wake ourself
    __bic_SR_register_on_exit(LPM3_bits);
}

